---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT
source: html/0d39d8eb-8f85-3b6b-66bf-99f86f0423fe.htm
---
# StructuralSectionGeneralT Properties

Common set of parameters for structural analysis.